---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunPath2d
source: html/1d707f08-59bf-d4a5-3876-7dbc801d414e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunPath2d Property

"Show Run's Path 2D"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowRunPath2d { get; }
```